## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.ai_answers`                                                      |
|        | `aws_acm_certificate_validation.ai_answers`                                           |
|        | `aws_lb.ai_answers`                                                                   |
|        | `aws_lb_listener.ai_answers_listener`                                                 |
|        | `aws_lb_target_group.ai_answers`                                                      |
|        | `aws_route53_record.ai_answers`                                                       |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.cdssandbox.xyz&quot;]`   |
|        | `aws_security_group.ai_answers_load_balancer_sg`                                      |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers will be created
  + resource "aws_acm_certificate" "ai_answers" {
      + arn                       = (known after apply)
      + domain_name               = "ai-answers.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.ai-answers.cdssandbox.xyz",
          + "ai-answers.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                  = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.ai_answers will be created
  + resource "aws_acm_certificate_validation" "ai_answers" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb.ai_answers will be created
  + resource "aws_lb" "ai_answers" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ai-answers-lb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-003fd64c591590158",
          + "subnet-0eafde13f87668d34",
        ]
      + tags                                                         = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                                                     = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.ai_answers_listener will be created
  + resource "aws_lb_listener" "ai_answers_listener" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

  # aws_lb_target_group.ai_answers will be created
  + resource "aws_lb_target_group" "ai_answers" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "ai-answers"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-006a4fac589012225"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.ai_answers will be created
  + resource "aws_route53_record" "ai_answers" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
        name            = null
      + type            = "A"
      + zone_id         = "1234567890"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "1234567890"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "1234567890"
    }

  # aws_security_group.ai_answers_load_balancer_sg will be created
  + resource "aws_security_group" "ai_answers_load_balancer_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + from_port        = 3001
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3001
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS inbound traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "ai_answers_load_balancer_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all               = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-006a4fac589012225"
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ai_answers_load_balancer_sg = (known after apply)
  + lb_listener                 = {
      + alpn_policy                                                           = null
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + default_action                                                        = [
          + {
              + authenticate_cognito = []
              + authenticate_oidc    = []
              + fixed_response       = []
              + forward              = []
              + order                = (known after apply)
              + redirect             = []
              + target_group_arn     = (known after apply)
              + type                 = "forward"
            },
        ]
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + mutual_authentication                                                 = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = null
      + tags_all                                                              = {
          + CostCentre = "ai-answers-prod"
          + Terraform  = "true"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)
      + timeouts                                                              = null
    }
  + lb_target_group_arn         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
